app/controllers/movies_controller.rb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."movie_id" = ? ORDER BY created_at DESC  [["movie_id", 1]]
---
  def show
    @ratings = Rating.where(movie_id: @movie.id).order("created_at DESC")

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)