app/controllers/ratings_controller.rb

  def create
    @rating = Rating.new(rating_params)
    @rating.user_id = current_user.id
    @rating.movie_id =  @movie.id

    respond_to do |format|
      if @rating.save
---
INSERT INTO "ratings" ("rate", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rate", 2], ["comment", "worst movie"], ["created_at", "2017-12-23 16:52:08.859232"], ["updated_at", "2017-12-23 16:52:08.859232"], ["user_id", 1], ["movie_id", 1]]

  def destroy
    @rating.destroy
---
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 1]]

    def set_rating
      @rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]